# Описание проекта /Приложение авматизации для кафе(ресторана)/.
# ПРиложение разворачивается на терминале(десктоп, планшете, мобильном устройстве,) 
# Front и Backend разворачиваем на сервере.
# В приложении будет реализована авторизация персонала и в зависимости от статуса привелегии 
#   на выполнение тех или операций(таблица kafePersonal). 
# В функционале приложения предпологается следующие функции: -создание групп номенклатур(таблица groupMenu), 
#   создание номенклатур(таблица positionsmenu), 
#  -создание, редактирование, отмена заказа. Передача заказа на терминал кухни(таблица workPlase).
# -производить формирование предчека и после оплаты печать чека.
# -принимать оплату наличными, банковскими картами, платежными системами.
# -формирование отчетов прихода, расхода, продаж, списания.
# Все данные приложение будут хранится в таблицах базы данных.

# Cтруктуру базы данных
# workPlase(id) = kafepersonal(workPlase) 
# workplase(id) = positionsmenu(workplase) 
# groupmenu(id) = positionsmenu(groupmenu) 
 
 










